app/Controllers/Admin.php

SELECT *
FROM `buku`
SELECT *
FROM `user`
SELECT *
FROM `petugas`
---
	public function dashboard(): string
	{
        $modelBuku = new ModelBuku();
        $data['buku'] = $modelBuku->findAll();

        $modelUser = new ModelUser();
        $data['user'] = $modelUser->findAll();

        $modelPetugas = new ModelPetugas();
        $data['petugas'] = $modelPetugas->findAll();

SELECT *
FROM `petugas`
---
    public function petugas(): string
    {
        $modelPetugas = new ModelPetugas();
        $data['petugas'] = $modelPetugas->findAll();