app/Models/ModelKoleksi.php

    public function getKoleksiWithJudulandCoverBukuByUserID($userID)
    {
        return $this->select('koleksipribadi.*, buku.CoverBuku')
                    ->join('buku', 'buku.BukuID = koleksipribadi.BukuID')
                    ->where('koleksipribadi.UserID', $userID)
                    ->get()
                    ->getResultArray();
---
SELECT `koleksipribadi`.*, `buku`.`CoverBuku`
FROM `koleksipribadi`
JOIN `buku` ON `buku`.`BukuID` = `koleksipribadi`.`BukuID`
WHERE `koleksipribadi`.`UserID` = '1'