app/Models/ModelPeminjaman.php

INSERT INTO `peminjam` (`UserID`, `BukuID`, `TanggalPeminjaman`, `TanggalPengembalian`, `TotalBuku`, `StatusPeminjaman`) VALUES ('1', '2', '2024-03-03', '2024-03-04', '1', 'meminjam')
---
    public function savePeminjaman($data)
    {
        return $this->insert($data);

SELECT `peminjam`.*, `buku`.`Judul`, `buku`.`CoverBuku`
FROM `peminjam`
JOIN `buku` ON `buku`.`BukuID` = `peminjam`.`BukuID`
WHERE `peminjam`.`UserID` = '1'
---
     public function getPeminjamanWithJudulandCoverBukuByUserID($userID)
    {
        return $this->select('peminjam.*, buku.Judul, buku.CoverBuku')
                    ->join('buku', 'buku.BukuID = peminjam.BukuID')
                    ->where('peminjam.UserID', $userID)
                    ->get()
                    ->getResultArray();

SELECT *
FROM `peminjam`
WHERE `TanggalPengembalian` < '2024-03-03'
AND `StatusPeminjaman` = 'meminjam'
---
    public function cekTanggalPengembalian()
    {
        $currentDate = date('Y-m-d');

        $overdueReturns = $this->where('TanggalPengembalian <', $currentDate)
                              ->where('StatusPeminjaman', 'meminjam')
                              ->findAll();