app/Models/ModelBuku.php

    public function dapatkan_buku($bukuID)
    {
        if ($bukuID == false) {
            return $this->findAll();
        } else {
            $result = $this->getWhere(['BukuID' => $bukuID])->getRow();
---
SELECT *
FROM `buku`
WHERE `BukuID` = '2'

    public function kurangiStok($bukuID, $stok_baru)
    {
        $builder = $this->db->table($this->table);
        $builder->where('BukuID', $bukuID);

        $data = ['stok' => $stok_baru];
        $builder->update($data);
---
UPDATE `buku` SET `stok` = 6
WHERE `BukuID` = '2'