app/Models/ModelUlasan.php

SELECT `ulasanbuku`.*, `user`.*, `buku`.*
FROM `ulasanbuku`
JOIN `user` ON `user`.`UserID` = `ulasanbuku`.`UserID`
JOIN `buku` ON `buku`.`BukuID` = `ulasanbuku`.`BukuID`
---
    public function ulasanByBuku()
    {
        return $this->select('ulasanbuku.*, user.*, buku.*')
            ->join('user', 'user.UserID = ulasanbuku.UserID')
            ->join('buku', 'buku.BukuID = ulasanbuku.BukuID')
            ->get()
            ->getResultArray();