app/Models/ModelPetugas.php

SELECT *
FROM `petugas`
---
    public function getLevels()
    {
        $query = $this->db->table('petugas')->get();

SELECT *
FROM `petugas`
WHERE `email` = 'tian@gmail.com'
---
    public function dapatkan_petugas($email) {
        if ($email == false) {
            return $this->findAll();
        } else {
            return $this->getWhere(['email' => $email]);