app/Models/ModelUser.php

INSERT INTO `user` (`Username`, `Password`, `Email`, `NamaLengkap`, `Alamat`) VALUES ('tian', '$2y$10$5QNnoIxYhyKcfLVuJ6XrsenMukD.AWXw.cT7fp0nAX2/4akYEP6O2', 'tian@gmail.com', 'tian', 'bekasi')
---
	public function tambah_akun($data)
	{
		$builder = $this->db->table($this->table);
		return $builder->insert($data);

SELECT *
FROM `user`
WHERE `email` = 'christianoa3231@gmail.com'
---
	public function dapatkan_user($email) {
		if ($email == false) {
			return $this->findAll();
		} else {
			return $this->getWhere(['email' => $email]);